In [1]:
import pandas as pd
import numpy as np
from word2number.w2n import word_to_num as w2n
from sklearn import linear_model

In [2]:
df = pd.read_csv('002 (Practice).csv')
df

      exp  testScore  interviewScore  salary
0     NaN        8.0               9   50000
1     NaN        8.0               6   45000
2    five        6.0               7   60000
3     two       10.0              10   65000
4   seven        9.0               6   70000
5   three        7.0              10   62000
6     ten        NaN               7   72000
7  eleven        7.0               8   80000

In [5]:
# NaN handling
df.exp.fillna('zero', inplace=True)
df.testScore.fillna(df['testScore'].mean(), inplace=True)

# Convert 1st column from word to number
df.exp = df.exp.apply(w2n)
df

   exp  testScore  interviewScore  salary
0    0   8.000000               9   50000
1    0   8.000000               6   45000
2    5   6.000000               7   60000
3    2  10.000000              10   65000
4    7   9.000000               6   70000
5    3   7.000000              10   62000
6   10   7.857143               7   72000
7   11   7.000000               8   80000

In [6]:
reg = linear_model.LinearRegression()
reg.fit(df[['exp', 'testScore', 'interviewScore']], df.salary)
reg.coef_, reg.intercept_

(array([2827.63404314, 1912.93803053, 2196.9753141 ]), 17237.3303137272)

### Calculate Salary for following

##### 2 years experience, 9 test score, 6 interview score
##### 12 years experience, 10 test score, 10 interview Score

In [7]:
predict1 = reg.predict([[2, 9, 6]])
predict2 = reg.predict([[12, 10, 10]])

print(predict1, predict2)

[53290.89255945] [92268.07227784]